Tekla.Structures.Drawing.PickerInput.PickerInputTypes_e
The possible types of derived PickerInput instances.

Tekla.Structures.Drawing.PickerInput.PickerInputTypes_e.PICKER_INPUT_INVALID
The type is invalid object.

Tekla.Structures.Drawing.PickerInput.PickerInputTypes_e.PICKER_INPUT_ONE_POINT
The type is PickerInputPoint.

Tekla.Structures.Drawing.PickerInput.PickerInputTypes_e.PICKER_INPUT_TWO_POINTS
The type is PickerInputTwoPoints.

Tekla.Structures.Drawing.PickerInput.PickerInputTypes_e.PICKER_INPUT_THREE_POINTS
The type is PickerInputThreePoints.

Tekla.Structures.Drawing.PickerInput.PickerInputTypes_e.PICKER_INPUT_N_POINTS
The type is PickerInputNPoints.

Tekla.Structures.Drawing.PickerInput.PickerInputTypes_e.PICKER_INPUT_OBJECT
The type is PickerInputObject.

Tekla.Structures.Drawing.PickerInput.PickerInputTypes_e.PICKER_INPUT_OBJECT_AND_POINT
The type is PickerInputObjectAndAPoint.

Tekla.Structures.Drawing.PickerInput.PickerInputTypes_e.PICKER_INPUT_INTERRUPT
The type is PickerInputInterrupt.